
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsights
* Update
  * azurerm_key_vault_secret.app_insights_key
  * module.redis6-cache.azurerm_redis_cache.redis
* Delete
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "xui-webapp-appinsights-aat"
      + resource_group_name                   = "xui-webapp-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "expert-ui"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }
    }

  # azurerm_key_vault_secret.app_insights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://rpx-aat.vault.azure.net/secrets/appinsights-instrumentationkey-mc/e536fd04309e4472a8f98c6030c61e81"
        name                    = "appinsights-instrumentationkey-mc"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be destroyed
  # (because azurerm_application_insights.this is not in configuration)
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "46b383c1-eae6-46f8-a657-f5639d68b379" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 50 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/xui-webapp-aat/providers/Microsoft.Insights/components/xui-webapp-appinsights-aat" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "xui-webapp-appinsights-aat" -> null
      - resource_group_name                   = "xui-webapp-aat" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"         = "expert-ui"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null
      - workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
    }

  # module.redis6-cache.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-mc-redis6-cache-aat/providers/Microsoft.Cache/redis/xui-webapp-aat"
        name                          = "xui-webapp-aat"
        tags                          = {
            "application"         = "expert-ui"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rpx-xui-webapp.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#xui-pipeline"
            "environment"         = "staging"
            "managedBy"           = "Expert UI"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 1330 -> 642
          ~ maxmemory_delta                         = 1330 -> 642
          ~ maxmemory_reserved                      = 1330 -> 642
            # (8 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":3479,"Program":"tfcmt","SHA1":"","Vars":{}} -->